title: Microsoft 365 security alert detected
status: experimental
description: Microsoft 365 have predefined policy to identify the suspicious activity
references:
    - https://learn.microsoft.com/en-us/purview/alert-policies#default-alert-policies
    - https://learn.microsoft.com/en-us/defender-cloud-apps/what-is-defender-for-cloud-apps
author: Harish C M '@harishcm21'
date: 2023/08/31
tags:
    - multiple MITRE technique could be possible
logsource:
    product: Microsoft 365
    service: Office 365 Security & Compliance, Cloud App Security
detection:
    selection:
        Operation: 'AlertTriggered'
    condition: selection
falsepositives:
    - As the detection made by the Microsoft policy and algorithm there could be few possibility
level: high
